# Due to uneven quotes in the file, the file was not uploading in the database, so I removed quotes from the file with white space

with open('/home/hp/code/movie_companies.csv', "r+", encoding="utf-8") as csv_file:
    content = csv_file.read()

with open('/home/hp/code/movie_companies.csv', "w+", encoding="utf-8") as csv_file:
    csv_file.write(content.replace('"', ''))

In [47]:
with open('/home/hp/Desktop/Thesis/code/movie_infos/new.csv', "r+", encoding="utf-8") as csv_file: content = csv_file.read()

with open('/home/hp/Desktop/Thesis/code/movie_infos/new.csv', "w+", encoding="utf-8") as csv_file:
    csv_file.write(content.replace('"', ''))

In [93]:
# # import pandas
# import pandas as pd
  
# # create data frame
# Data = {'Name#': ['Mukul', 'Rohan', 'Mayank',
#                   'Shubham', 'Aakash'],
          
#         'Location': ['Saharanpur', 'Meerut', 'Agra',
#                      'Saharanpur', 'Meerut'],
          
#         'Pay': [25000, 30000, 35000, 40000, 45000]}
  
# df = pd.DataFrame(Data)
  
# # print original data frame
# print(df)
  
# # remove special character
# df.columns = df.columns.str.replace('[#,@,&]', '')
  
# # print file after removing special character
# print("\n\n", df)

# Linux command to remove comma between double quotes from CSV file

awk -F'"' -v OFS='' '{ for (i=2; i<=NF; i+=2) gsub(",", "", $i) } 1' xaa > new.csv

Input: 12266123,571772,16,"USA:16 ,January 2012",
Output: 12266123,571772,16,USA:16 January 2012,

# Now I removed the special character from each column and imported the file as panda dataframe

In [98]:
import pandas as pd

df = pd.read_csv("/home/hp/Desktop/Thesis/code/movie/new.csv", error_bad_lines=False,encoding="utf-8", engine='python')
pd.options.display.float_format = '{:.0f}'.format
df.head()

# df.columns = df.columns.str.replace('[#,@,&,/]', '')
# print("\n\n", df)

Skipping line 2149905: ',' expected after '"'
Skipping line 2264539: ',' expected after '"'
Skipping line 2273845: ',' expected after '"'

   4930403  2000585  8  France Unnamed: 4
0  4930404  2000586  8  Canada        NaN
1  4930405  2000587  8  Canada        NaN
2  4930406  2000589  8      UK        NaN
3  4930407  2000588  8      UK        NaN
4  4930408  2000590  8      UK        NaN

# Downloaded the panda file in csv

In [99]:

df.to_csv("/home/hp/Desktop/Thesis/code/movie/ckeck1.csv",index=False,encoding="utf-8",float_format='{:.0f}'.format)

# # Finally I got a csv file(comma seperated file), since I removed all the special characters from file which leads to remove quotes even from char data. So, to ensure the char data is within double quotes I ran unix command

awk -F, 'BEGIN{ OFS=FS } { $5="\""$5"\""; print }' < recheck.csv > recheck1.csv

This leads to put quotes in column 5 only

Reference: https://unix.stackexchange.com/questions/437164/is-it-possible-to-put-double-quotes-in-just-a-few-columns-using-sed

    Finally uploaded the file to postgresl
    
   \copy movie_companies from '/home/hp/code/recheck1.csv' DELIMITER ','CSV HEADER;